In [250]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib as plt
import warnings
warnings.filterwarnings('ignore')
# import mysql.connector as sql
import sqlite3

from sqlalchemy import create_engine

In [251]:
data_credit_profiles = pd.read_csv('./Data/credit_profiles.csv')
data_credit_profiles.head(3)

,cust_id,credit_score,credit_utilisation,outstanding_debt,credit_inquiries_last_6_months,credit_limit
0,1,749,0.585171,19571.0,0.0,40000.0
1,2,587,0.107928,161644.0,2.0,1250.0
2,3,544,0.854807,513.0,4.0,1000.0

In [252]:
data_credit_profiles.shape

(1004, 6)

In [253]:
data_customers = pd.read_csv('./Data/customers.csv')
data_customers.head(3)

,cust_id,name,gender,age,location,occupation,annual_income,marital_status
0,1,Manya Acharya,Female,2,City,Business Owner,358211.0,Married
1,2,Anjali Pandey,Female,47,City,Consultant,65172.0,Single
2,3,Aaryan Chauhan,Male,21,City,Freelancer,22378.0,Married

In [254]:
data_customers.shape

(1000, 8)

In [255]:
data_customers.isnull().sum()

cust_id            0
name               0
gender             0
age                0
location           0
occupation         0
annual_income     50
marital_status     0
dtype: int64

In [256]:
data_transactions = pd.read_csv('./Data/transactions.csv')
data_transactions.head(3)

,tran_id,cust_id,tran_date,tran_amount,platform,product_category,payment_type
0,1,705,2023-01-01,63,Flipkart,Electronics,Phonepe
1,2,385,2023-01-01,99,Alibaba,Fashion & Apparel,Credit Card
2,3,924,2023-01-01,471,Shopify,Sports,Phonepe

In [257]:
data_transactions.shape

(500000, 7)

In [258]:
median_income_by_occupation = data_customers.groupby('occupation')['annual_income'].median()
pd.DataFrame(median_income_by_occupation)

                     annual_income
occupation
Accountant                 65265.0
Artist                     45794.0
Business Owner            261191.5
Consultant                 58017.0
Data Scientist            135759.0
Freelancer                 46759.0
Fullstack Developer        76774.0

In [259]:
data_customers2 = data_customers.copy()

In [260]:
data_customers2.isnull().sum()

cust_id            0
name               0
gender             0
age                0
location           0
occupation         0
annual_income     50
marital_status     0
dtype: int64

In [261]:
pd.isnull('annual_income')

False

In [262]:
def get_med_val(row):
    if pd.isnull(row['annual_income']):
        return median_income_by_occupation[row['occupation']]
    else:
        return row['annual_income']

In [263]:
data_customers2['annual_income'] = data_customers2.apply(
    get_med_val,
    axis=1
)

In [264]:
data_customers2.isnull().sum()

cust_id           0
name              0
gender            0
age               0
location          0
occupation        0
annual_income     0
marital_status    0
dtype: int64

In [265]:
data_customers.isnull().sum()

cust_id            0
name               0
gender             0
age                0
location           0
occupation         0
annual_income     50
marital_status     0
dtype: int64

In [266]:
data_customers2[data_customers2.annual_income< 100].shape

(10, 8)

In [267]:
for index, row in data_customers2.iterrows():
 if row['annual_income'] < 100:
  data_customers2.at[index,'annual_income'] = median_income_by_occupation[row['occupation']]

In [268]:
data_customers2[data_customers2.annual_income< 100].shape

(0, 8)

In [269]:
data_customers2['age']

0       2
1      47
2      21
3      24
4      48
       ..
995    26
996    55
997    29
998    47
999    28
Name: age, Length: 1000, dtype: int64

In [270]:
data_customers2['age'].isnull().sum()

0

In [271]:
A1 = 14
A2= 81

In [272]:
A1,A2

(14, 81)

In [273]:
outliarsData1 = data_customers2[(data_customers2.age<14)|(data_customers2.age>81)]
outliarsData1

,cust_id,name,gender,age,location,occupation,annual_income,marital_status
0,1,Manya Acharya,Female,2,City,Business Owner,358211.0,Married
41,42,Aaryan Shah,Male,110,City,Artist,7621.0,Married
165,166,Sia Dutta,Female,1,City,Freelancer,39721.0,Single
174,175,Rohan Sharma,Male,110,City,Freelancer,23723.0,Married
222,223,Arjun Batra,Male,110,Suburb,Freelancer,210987.0,Married
277,278,Aarav Tandon,Male,110,City,Consultant,96522.0,Single
295,296,Ayush Pandey,Male,1,Rural,Accountant,55254.0,Married
325,326,Virat Goel,Male,110,City,Accountant,61021.0,Single
610,611,Rehan Verma,Male,135,Rural,Business Owner,444776.0,Married
692,693,Dhruv Jha,Male,1,City,Business Owner,83045.0,Married
703,704,Aanya Sharma,Female,110,City,Freelancer,43404.0,Single
709,710,Anika Verma,Female,110,City,Data Scientist,98417.0,Married
728,729,Rehan Yadav,Male,135,City,Business Owner,382836.0,Married
832,833,Ridhi Raj,Female,110,City,Fullstack Developer,95379.0,Single
845,846,Rohan Jaiswal,Male,1,City,Consultant,20838.0,Married
855,856,Aanya Taneja,Female,2,City,Fullstack Developer,30689.0,Married
895,896,Krishna Goswami,Male,1,City,Freelancer,31533.0,Married
923,924,Kunal Patel,Male,110,City,Freelancer,51629.0,Married
951,952,Virat Shetty,Male,135,City,Data Scientist,49677.0,Married
991,992,Arya Dube,Male,135,City,Fullstack Developer,93267.0,Single

In [274]:
outliarsData1.age.min()

1

In [275]:
outliarsData1.shape

(20, 8)

In [276]:
validData1 = data_customers2[(data_customers2.age>14)&(data_customers2.age<81)]
validData1

,cust_id,name,gender,age,location,occupation,annual_income,marital_status
1,2,Anjali Pandey,Female,47,City,Consultant,65172.0,Single
2,3,Aaryan Chauhan,Male,21,City,Freelancer,22378.0,Married
3,4,Rudra Bali,Male,24,Rural,Freelancer,33563.0,Married
4,5,Advait Malik,Male,48,City,Consultant,39406.0,Married
5,6,Arya Das,Male,22,City,Freelancer,44887.0,Married
...,...,...,...,...,...,...,...,...
995,996,Manya Vasudeva,Female,26,City,Freelancer,46759.0,Married
996,997,Aarav Dhawan,Male,55,City,Business Owner,290061.0,Single
997,998,Rehan Jha,Male,29,City,Fullstack Developer,139141.0,Married
998,999,Amara Rathore,Female,47,City,Business Owner,261191.5,Married
999,1000,Akshay Choudhary,Male,28,City,Freelancer,226873.0,Married

In [277]:
validData1.age.min()

18

In [278]:
data_customers2.age.median()

32.0

In [279]:
data_customers2.age.mean()

36.405

In [280]:
median_age_by_occupation = data_customers.groupby('occupation')['age'].median()
pd.DataFrame(median_age_by_occupation)

                      age
occupation
Accountant           31.5
Artist               26.0
Business Owner       51.0
Consultant           46.0
Data Scientist       32.0
Freelancer           24.0
Fullstack Developer  27.5

In [281]:
data_customers.annual_income

0      358211.0
1       65172.0
2       22378.0
3       33563.0
4       39406.0
         ...
995         NaN
996    290061.0
997    139141.0
998         NaN
999    226873.0
Name: annual_income, Length: 1000, dtype: float64

In [282]:
data_customers2.age.min(),data_customers2.age.max()

(1, 135)

##### Here we loop tru the index of the outliars, then match them with the index of the main df, and have replaced with the new median

In [283]:
for index, row in outliarsData1.iterrows():
  data_customers2.at[index,'age'] = median_age_by_occupation[row['occupation']]

In [284]:
data_customers2.age.min(),data_customers2.age.max()

(18.0, 64.0)

In [285]:
data_customers2[(data_customers2.age<14)|(data_customers2.age>81)]

Empty DataFrame
Columns: [cust_id, name, gender, age, location, occupation, annual_income, marital_status]
Index: []

In [286]:
data_customers2.describe()

           cust_id          age  annual_income
count  1000.000000  1000.000000    1000.000000
mean    500.500000    35.541500  140483.548500
std     288.819436    12.276634  110463.002934
min       1.000000    18.000000    5175.000000
25%     250.750000    26.000000   49620.500000
50%     500.500000    32.000000  115328.000000
75%     750.250000    44.250000  195514.250000
max    1000.000000    64.000000  449346.000000

##### Data Cleaned and Ourliars removed

In [287]:
data_customers2.age.min(),data_customers2.age.max()

(18.0, 64.0)

In [290]:
data_customers2.annual_income.min(),data_customers2.annual_income.max()

(5175.0, 449346.0)

In [289]:
# engine = create_engine('mysql+pymysql://root:juud@host:3306/e_master_card')